'''
    1. Выведите все символы из строки «Программисты — не волшебники, способные вернуть удалённые 
    в прошлом году фотографии, взломать за 5 секунд любой сайт и починить микроволновку. 
    Но именно эти люди создают то пространство, где и появляются мемы про них», значения индексов 
    которых делятся на 10.
'''
from code import interact


str =  "Программисты — не волшебники, способные вернуть удалённые в прошлом году фотографии, \
взломать за 5 секунд любой сайт и починить микроволновку. Но именно эти люди создают то \
пространство, где и появляются мемы про них"

result_list = []
for value in str:
    if str.index(value)%10 == 0:
        result_list.append(value)
    
print(''.join(result_list))

'''
    2. Напишите скрипт по проверки условия: если число больше 20 и меньше 40 - вывести “YES”, 
    иначе “NO”.
'''

num = int(input("Введите число: "))
if num > 20 and num < 40:
    print("YES")
else:
    print("NO")

'''
    3. Выведите числа из диапазона от 1 до 10 двумя способами, используя циклы for и while.
'''

#while
num = 1
while num <= 10:
    print(num)
    num +=1

#for
for i in range(1, 11, 1):
    print(i)
    
'''
    4. Посчитайте количество вхождений элемента со значением «3» тремя способами в 
    сле­дующем списке: [3 0 1 3 0 4 3 3 4 5 6 6 1 3], используя цикл for, while и метод count.
'''

testlist = [3, 0, 1, 3, 0, 4, 3, 3, 4, 5, 6, 6, 1, 3]

#count
print(testlist.count(3))

#for
sum = 0
for item in testlist:
    if item == 3:
        sum +=1

print(sum)

#while
sum = 0
i = 0
while i < len(testlist):
    if testlist[i] == 3:
        sum+=1
    i+=1
        
print(sum)

'''
    3. Напишите программу, выводящую среднее из десяти значений.
'''

lis = [1, 20, 31, 53, 93, 10, 53, 93, 2, 4]
print(sum(lis)/len(lis))
#подсчет суммы в цикле, посчет количества итеракций и деление суммы на количество итеракций
sum =0
iteration = 0
for item in lis:
    sum+=item
    iteration+=1

print(sum/iteration)

'''
    3. Выведите числа из диапазона от -20 до 20 с шагом 3 двумя способами, 
    используя цикл for и while.
'''
#while
num = -20
while num <= 20:
    print(num)
    num +=3

#for
for num in range(-20, 20, 3):
    print(num)

'''
    3. Напишите программу, которая считывает целое число (месяц), после чего выводит 
    сезон к которому этот месяц относится
'''

date = input("Введите дату в формате dd-mm-YYYY или dd-mm-YY: ").split("-")
month = int(date[1])
if month >= 3 and month <=5:
    print("Весна")
elif month >= 6 and month <=8:
    print("Лето")
elif month >= 9 and month <=11:
    print("Осень")
else:
    print("Зима")