#1. Напишите скрипт, вычисляющий двумя способами длину строки.
def findLength(str): 
    length = 0   
    for i in str: 
        length += 1
    return length 

str = input("Введите строку для расчета ее длины: ")
print(str)
print("Расчет длины строки первым способом: ", len(str))
print("Расчет длины строки вторым способом: ", findLength(str))

#2. Напишите скрипт, который заменяет произвольный символ в строке на «$».
def symbol_replace(str, syb):
    if (syb <= len(str) and syb >= 0):
        liststr = list(str)
        liststr[syb] = "$"
        print("".join(liststr))
    else:
        print("Введен неверный индекс символа")
        syb = input("Введите новый символ для замены или напишите слово 'Стоп' или 'Stop' для отмены: ")
        if (syb.upper() == "СТОП" or syb.upper() == "STOP"):
            print("Операция завершена")
        else:
            symbol_replace(str, syb)

str = input("Введите строку в которой будет заменены символы: ")
syb = int(input(f"Введите индекс символа который хотите заменить на '$' от 0 до {len(str)-1}: "))
symbol_replace(str, syb)

#3. Напишите скрипт, который позволяет из строки собрать другую по следующим правилам: новая строка должна состоять из двух первых и двух последних элементов исходной строки. Если длина исходной строки меньше двух, то результатом будет пустая строка.
str = list(input("Введите слово состоящее более чем из двух символов: ").strip())
if(len(str) > 2):
    del str[2:len(str)-2]
    print("Из строки получилось следующее: ", ''.join(str))
else:
    print(''.join(str))

#4. Напишите скрипт, который позволяет инвертировать последователь­ность элементов в строке.
str = input("Введите строку которую необходимо инвертировать: ")
print("Инвертирование при помощи срезов: ", str[::-1])
print("Инвертирование при помощи встроенной функции: ", ''.join(reversed(str)))

#варианты написания в одну строку
print("Инвертирование при помощи срезов: ", 
    input("Введите строку которую необходимо инвертировать: ")[::-1])
print("Инвертирование при помощи встроенной функции: ", 
    ''.join(reversed(input("Введите строку которую необходимо инвертировать: "))))

#5. Напишите скрипт, выводящий все элементы строки с их номерами индексов.
str = input("Введите строку для получения индексов элементов: ")
for item in str:
    print(item, str.index(item))

#6. Поменяйте регистр элементов строки на противоположный.
print("Результат смены регистра строки: ", 
    input("Введи строку в которой необходимо сменить регистр: ").swapcase())

#7. Выведите символ, который встречается в строке чаще, чем остальные.
str = input("Введите строку для вывода наиболее часто встречающегося элемента: ")
def repeating_element(str):
    return [witem for witem in zip((str.count(item) 
        for item in set(str)),set(str)) 
            if witem[0] == max((str.count(item) for item in set(str)))]
print("Чаще всего встречается элемент(ы): ", repeating_element(str))